package com.raymond.httpclient.enums;
/**
 * 错误码
 *
 * @author :  raymond
 * @version :  V1.0
 * @date :  2019-10-18 16:07
 */
public enum ErrorCode {
	/**
	 * 账号格式不合法
	 */
	ERROR_CODE_300001("-300001", "账号格式不合法"),
	/**
	 * 密码格式不合法
	 */
	ERROR_CODE_300002("-300002", "密码格式不合法"),
	/**
	 * IP和端口信息不合法
	 */
	ERROR_CODE_300003("-300003", "IP和端口信息不合法"),
	/**
	 * IP不合法
	 */
	ERROR_CODE_300004("-300004", "IP不合法"),
	/**
	 * 端口不合法
	 */
	ERROR_CODE_300005("-300005", "端口不合法"),
	/**
	 * 手机号码格式不合法
	 */
	ERROR_CODE_300006("-300006", "手机号码格式不合法"),
	/**
	 * 发送内容长度不合法
	 */
	ERROR_CODE_300007("-300007", "发送内容长度不合法"),
	/**
	 * 扩展子号不合法
	 */
	ERROR_CODE_300008("-300008", "扩展子号不合法"),
	/**
	 * 流水号不合法
	 */
	ERROR_CODE_300009("-300009", "流水号不合法"),
	/**
	 * 密码加密失败
	 */
	ERROR_CODE_300010("-300010", "密码加密失败"),
	/**
	 * 业务类型不合法
	 */
	ERROR_CODE_300011("-300011", "业务类型不合法"),
	/**
	 * 扩展数据不合法
	 */
	ERROR_CODE_300012("-300012", "扩展数据不合法"),
	/**
	 * 发送优先级不合法
	 */
	ERROR_CODE_300013("-300013", "发送优先级不合法"),
	/**
	 * 个性化群发发送条数不在0到100之间
	 */
	ERROR_CODE_300014("-300014", "个性化群发发送条数不在0到100之间"),
	/**
	 * Message对象为空
	 */
	ERROR_CODE_300015("-300015", "Message对象为空"),
	/**
	 * msgid参数为空或者msgid长度不为0
	 */
	ERROR_CODE_300016("-300016", "msgid参数为空或者msgid长度不为0"),
	/**
	 * 账号或者密码错误
	 */
	ERROR_CODE_300017("-300017", "账号或者密码错误"),
	/**
	 * 发送类型错误
	 */
	ERROR_CODE_300018("-300018", "发送类型错误"),
	/**
	 * 上行mos为空或者mos集合大于0
	 */
	ERROR_CODE_300019("-300019", "上行mos为空或者mos集合大于0"),
	/**
	 * 状态报告rpts为空或者rpts集合大于0
	 */
	ERROR_CODE_300020("-300020", "状态报告rpts为空或者rpts集合大于0"),
	/**
	 * 请求路径为空
	 */
	ERROR_CODE_300021("-300021", "请求路径为空"),
	/**
	 * 是否需要日志设置不合法
	 */
	ERROR_CODE_300023("-300023", "是否需要日志设置不合法"),
	/**
	 * 相同内容群发时，手机号码超过最大支持数量(1000)
	 */
	ERROR_CODE_300024("-300024", "相同内容群发时，手机号码超过最大支持数量(1000)"),
	/**
	 * 内容编码失败
	 */
	ERROR_CODE_300025("-300025", "内容编码失败"),
	/**
	 * 单条发送失败
	 */
	ERROR_CODE_310001("-310001", "单条发送失败"),
	/**
	 * 相同内容发送失败
	 */
	ERROR_CODE_310002("-310002", "相同内容发送失败"),
	/**
	 * 个性发送失败
	 */
	ERROR_CODE_310003("-310003", "个性发送失败"),
	/**
	 * 获取上行失败
	 */
	ERROR_CODE_310004("-310004", "获取上行失败"),
	/**
	 * 获取状态报告失败
	 */
	ERROR_CODE_310005("-310005", "获取状态报告失败"),
	/**
	 * 获取余额失败
	 */
	ERROR_CODE_310006("-310006", "获取余额失败"),
	/**
	 * 设置账号信息失败
	 */
	ERROR_CODE_310007("-310007", "设置账号信息失败"),
	/**
	 * 账号不存在或者账号不可用
	 */
	ERROR_CODE_310008("-310008", "账号不存在或者账号不可用"),
	/**
	 * 无可用的账号
	 */
	ERROR_CODE_310009("-310009", "无可用的账号"),
	/**
	 * 设置账号检查线程启动失败
	 */
	ERROR_CODE_310010("-310010", "设置账号检查线程启动失败"),
	/**
	 * 设置账号检查线程停止失败
	 */
	ERROR_CODE_310011("-310011", "设置账号检查线程停止失败"),
	/**
	 * 设置全局参数失败
	 */
	ERROR_CODE_310012("-310012", "设置全局参数失败"),
	/**
	 * 移除账号失败
	 */
	ERROR_CODE_310013("-310013", "移除账号失败"),
	/**
	 * 该账号在账号列表不存在，无需移除
	 */
	ERROR_CODE_310014("-310014", "该账号在账号列表不存在，无需移除"),
	/**
	 * http请求失败
	 */
	ERROR_CODE_310099("-310099", "http请求失败"),
	/**
	 * 未知错误请检查代码
	 */
	ERROR_CODE_310100("-310100","未知错误请检查代码"),
	/**
	 * 发送成功
	 */
	SUCCESS_CODE_0("0","发送成功"),
	/**
	 * 发送成功
	 */
	SUCCESS_CODE_000("000","发送成功"),
	/**
	 * 请求参数解析异常
	 */
	ERROR_CODE_800001("-800001", "请求参数解析异常"),
	/**
	 * 请求参数异常
	 */
	ERROR_CODE_800002("-800002", "请求参数异常"),
	/**
	 * 服务器接收接口请求参数失败
	 */
	ERROR_CODE_800003("-800003", "服务器接收接口请求参数失败"),
	/**
	 * 用户名或密码错误
	 */
	ERROR_CODE_800004("-800004", "用户名或密码错误"),
	/**
	 * 获取机构余额失败
	 */
	ERROR_CODE_800005("-800005", "获取机构余额失败"),
	/**
	 * 余额不足
	 */
	ERROR_CODE_800006("-800006", "余额不足"),
	/**
	 * 没有有效的发送号码
	 */
	ERROR_CODE_800007("-800007", "没有有效的发送号码"),
	/**
	 * 短信内容超过最大发送长度
	 */
	ERROR_CODE_800008("-800008", "短信内容超过最大发送长度"),
	/**
	 * 区域编码不存在
	 */
	ERROR_CODE_800009("-800009", "区域编码不存在"),
	/**
	 * 时间长度非法
	 */
	ERROR_CODE_800010("-800010", "时间长度非法"),
	/**
	 * 机构扣费失败
	 */
	ERROR_CODE_800011("-800011", "机构扣费失败"),
	/**
	 * 创建短信任务失败
	 */
	ERROR_CODE_800012("-800012", "创建短信任务失败"),
	/**
	 * 请求地址错误
	 */
	ERROR_CODE_800013("-800013", "请求地址错误"),
	/**
	 * 短信内容为空
	 */
	ERROR_CODE_800014("-800014", "短信内容为空");



	private String errorCode;

	private String message;

	public int getErrorCode() {
		return Integer.parseInt(errorCode);
	}

	public String getStrErrorCode() {
		return errorCode;
	}

	public void setErrorCode(String errorCode) {
		this.errorCode = errorCode;
	}

	public String getMessage() {
		return message;
	}

	public void setMessage(String message) {
		this.message = message;
	}

	private ErrorCode(String value, String desc) {
		this.errorCode = value;
		this.message = desc;
	}

}
